app/Http/Controllers/Api/LocationController.php

    public function regions(Request $request)
    {
        $regions = Region::orderBy('name')->get(['id', 'name as text']);
---
select `id`, `name` as `text` from `regions` order by `name` asc

    public function provinces(Request $request, $regionId)
    {
        $provinces = Province::where('region_id', $regionId)
            ->orderBy('name')
            ->get(['id', 'name as text']);
---
select `id`, `name` as `text` from `provinces` where `region_id` = '19' order by `name` asc

    public function cities(Request $request, $provinceId)
    {
        $cities = City::where('province_id', $provinceId)
            ->orderBy('name')
            ->get(['id', 'name as text']);
---
select `id`, `name` as `text` from `cities` where `province_id` = '93' order by `name` asc

    public function cityDetails(Request $request, $cityId)
    {
        // Carica il comune insieme alla sua relazione 'postalCodes', selezionando solo i campi necessari
        $city = City::with('postalCodes:id,city_id,code')->find($cityId);
---
select * from `cities` where `cities`.`id` = '1736' limit 1
select `id`, `city_id`, `code` from `postal_codes` where `postal_codes`.`city_id` in (1736)