app/Http/Controllers/Traits/HandlesListViews.php

select * from `list_views` where `module_class` = 'App\\Models\\Lead' and `user_id` = 2 order by `name` asc
---
    protected function getListViewData(Request $request, string $moduleClass, array $defaultColumns, array $columnLabels): array
    {
        $userViews = ListView::where('module_class', $moduleClass)
            ->where('user_id', auth()->id())
            ->orderBy('name')
            ->get();