app/Http/Controllers/CalendarController.php

    public function index()
    {
        // Recupera i contatti per il calendario
        // Potrebbe essere necessario filtrare o selezionare solo alcuni campi
        $contatti = Contact::all(); // Questo è un esempio base. Adatta in base alle tue esigenze.
        $aziende = Company::all(); // Esempio: se servono anche le aziende
        $leads = Lead::all(); // Esempio: se servono anche i lead
---
select * from `contacts`
select * from `companies`
select * from `leads`