app/Http/Controllers/CompanyController.php

select * from `module_blocks` where `module_class` = 'App\\Models\\Company' order by `order` asc
---
    private function getModuleStructure()
    {
        return ModuleBlock::where('module_class', Company::class)
            ->with(['fields' => fn ($q) => $q->where('is_visible', true)->orderBy('order')])
            ->orderBy('order')
            ->get();

select * from `companies` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `companies`
---
    public function index(Request $request)
    {
        $defaultColumns = ['name', 'email', 'phone', 'industry', 'assigned_to_id'];
        $columnLabels = [
            'name' => 'Nome', 'email' => 'Email', 'phone' => 'Telefono', 'industry' => 'Settore', 'assigned_to_id' => 'Assegnato a', 'vat_number' => 'Partita IVA', 'company_tax_code' => 'Codice Fiscale', 'address_city' => 'Città', 'main_contact_id' => 'Contatto Principale'
        ];
        $viewData = $this->getListViewData($request, Company::class, $defaultColumns, $columnLabels);
        $query = Company::query();
        if(in_array('assigned_to_id', $viewData['currentView']->columns)) { $query->with('assignedTo'); }
        if(in_array('main_contact_id', $viewData['currentView']->columns)) { $query->with('mainContact'); }
        $companies = $query->latest()->paginate(10);

select * from `users` order by `name` asc
---
    public function create()
    {
        $blocks = $this->getModuleStructure();
        $users = User::orderBy('name')->get();

select * from `companies` where `companies`.`id` = '1' limit 1
select * from `users` order by `name` asc
---
    public function edit($id)
    {
        $company = Company::findOrFail($id);
        $blocks = $this->getModuleStructure();
        $users = User::orderBy('name')->get();