app/Http/Controllers/ContactController.php

    public function index(Request $request)
    {
        $defaultColumns = ['first_name', 'last_name', 'company_id', 'email', 'phone'];
        $columnLabels = [
            'first_name' => 'Nome', 'last_name' => 'Cognome', 'salutation' => 'Saluto', 'codice_fiscale' => 'Codice Fiscale', 'email' => 'Email', 'phone' => 'Telefono Fisso', 'mobile_phone' => 'Cellulare', 'company_id' => 'Azienda', 'role' => 'Ruolo', 'assigned_to_id' => 'Assegnato a', 'description' => 'Descrizione', 'address_street' => 'Via', 'address_city' => 'Città', 'address_state' => 'Provincia', 'address_postalcode' => 'CAP', 'address_country' => 'Nazione', 'created_at' => 'Data Creazione', 'updated_at' => 'Ultima Modifica',
        ];
        $viewData = $this->getListViewData($request, Contact::class, $defaultColumns, $columnLabels);
        $query = Contact::query();
        if(in_array('company_id', $viewData['currentView']->columns)) { $query->with('company'); }
        if(in_array('assigned_to_id', $viewData['currentView']->columns)) { $query->with('assignedTo'); }
        $contacts = $query->latest()->paginate(15);
---
select * from `contacts` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `contacts`