app/Http/Controllers/DashboardController.php

    public function index()
    {
        // --- KPI Cards ---
        $totalContacts = Contact::count();
        $totalCompanies = Company::count();
        $openOpportunitiesValue = Opportunity::whereNotIn('stage', ['Chiusa Vinta', 'Chiusa Persa'])->sum('amount');
        $opportunitiesClosingThisMonth = Opportunity::whereNotIn('stage', ['Chiusa Vinta', 'Chiusa Persa'])
                                                    ->whereMonth('closing_date', Carbon::now()->month)
                                                    ->whereYear('closing_date', Carbon::now()->year)
                                                    ->count();

        // --- Attività di Oggi ---
        $todayActivities = Activity::whereDate('start_time', Carbon::today())
                                    ->orderBy('start_time', 'asc')
                                    ->get();

        // --- Dati per il Grafico a Imbuto (Funnel) ---
        $funnelStages = ['Qualificazione', 'Analisi Bisogni', 'Proposta', 'Negoziazione'];
        $funnelData = Opportunity::select('stage', DB::raw('count(*) as total'))
                                ->whereIn('stage', $funnelStages)
                                ->groupBy('stage')
                                ->orderByRaw("CASE stage WHEN 'Qualificazione' THEN 1 WHEN 'Analisi Bisogni' THEN 2 WHEN 'Proposta' THEN 3 WHEN 'Negoziazione' THEN 4 ELSE 5 END")
                                ->pluck('total', 'stage');

        $funnelLabels = $funnelStages;
        $funnelCounts = collect($funnelLabels)->map(function ($stage) use ($funnelData) {
            return $funnelData[$stage] ?? 0;
        })->toArray();

        // --- NUOVO WIDGET: Ultimi Lead Creati ---
        $recentLeads = Lead::latest()->take(5)->get(); // Prendiamo gli ultimi 5 lead
---
select count(*) as aggregate from `contacts`
select count(*) as aggregate from `companies`
select sum(`amount`) as aggregate from `opportunities` where `stage` not in ('Chiusa Vinta', 'Chiusa Persa')
select count(*) as aggregate from `opportunities` where `stage` not in ('Chiusa Vinta', 'Chiusa Persa') and month(`closing_date`) = '09' and year(`closing_date`) = 2025
select * from `activities` where date(`start_time`) = '2025-09-05' order by `start_time` asc
select `stage`, count(*) as total from `opportunities` where `stage` in ('Qualificazione', 'Analisi Bisogni', 'Proposta', 'Negoziazione') group by `stage` order by CASE stage WHEN 'Qualificazione' THEN 1 WHEN 'Analisi Bisogni' THEN 2 WHEN 'Proposta' THEN 3 WHEN 'Negoziazione' THEN 4 ELSE 5 END
select * from `leads` order by `created_at` desc limit 5