app/Http/Controllers/EmailListController.php

select count(*) as aggregate from `email_lists`
---
    public function index(Request $request)
    {
        $defaultColumns = ['name', 'description'];
        $columnLabels = ['name' => 'Nome Lista', 'description' => 'Descrizione'];

        $viewData = $this->getListViewData($request, EmailList::class, $defaultColumns, $columnLabels);
        $columnsForQuery = array_unique(array_merge($viewData['currentView']->columns, ['id']));
        $emailLists = EmailList::select($columnsForQuery)->latest()->paginate(15);