app/Http/Controllers/EmailTemplateController.php

    public function index()
    {
        $emailTemplates = EmailTemplate::all();
---
select * from `email_templates`