app/Http/Controllers/LeadController.php

    private function getModuleStructure()
    {
        return ModuleBlock::where('module_class', Lead::class)
            ->with(['fields' => fn ($q) => $q->where('is_visible', true)->orderBy('order')])
            ->orderBy('order')->get();
---
select * from `module_blocks` where `module_class` = 'App\\Models\\Lead' order by `order` asc

    public function index(Request $request)
    {
        $defaultColumns = ['first_name', 'last_name', 'company_id', 'status', 'email', 'phone', 'assigned_to_id'];
        $columnLabels = [
            'first_name' => 'Nome', 'last_name' => 'Cognome', 'company_id' => 'Azienda', 'status' => 'Stato', 'email' => 'Email', 'phone' => 'Telefono Fisso', 'mobile_phone' => 'Cellulare', 'source' => 'Fonte', 'assigned_to_id' => 'Assegnato a', 'created_at' => 'Data Creazione', 'updated_at' => 'Ultima Modifica',
        ];
        $viewData = $this->getListViewData($request, Lead::class, $defaultColumns, $columnLabels);
        $query = Lead::query()->where('status', '!=', 'Convertito');
        if(in_array('company_id', $viewData['currentView']->columns)) { $query->with('company'); }
        if(in_array('assigned_to_id', $viewData['currentView']->columns)) { $query->with('assignedTo'); }
        $leads = $query->latest()->paginate(15);
---
select * from `leads` where `status` != 'Convertito' order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `leads` where `status` != 'Convertito'

    public function create()
    {
        $blocks = $this->getModuleStructure();
        $users = User::orderBy('name')->get();
---
select * from `users` order by `name` asc

    public function show(Lead $lead)
    {
        $lead->load('company', 'assignedTo', 'notes.user', 'activities.user');
---
select * from `users` where `users`.`id` in (2)

    public function edit(Lead $lead)
    {
        $blocks = $this->getModuleStructure();
        $users = User::orderBy('name')->get();
---
select * from `users` order by `name` asc