app/Http/Controllers/OpportunityController.php

select count(*) as aggregate from `opportunities`
---
    public function index(Request $request)
    {
        $defaultColumns = ['name', 'company_id', 'stage', 'amount', 'closing_date', 'assigned_to_id'];
        $columnLabels = [
            'name' => 'Nome Opportunità', 'company_id' => 'Azienda', 'contact_id' => 'Contatto', 'stage' => 'Fase', 'amount' => 'Importo', 'closing_date' => 'Data Chiusura', 'assigned_to_id' => 'Assegnato a', 'description' => 'Descrizione'
        ];
        $viewData = $this->getListViewData($request, Opportunity::class, $defaultColumns, $columnLabels);
        $query = Opportunity::query();
        if(in_array('company_id', $viewData['currentView']->columns)) { $query->with('company'); }
        if(in_array('contact_id', $viewData['currentView']->columns)) { $query->with('contact'); }
        if(in_array('assigned_to_id', $viewData['currentView']->columns)) { $query->with('assignedTo'); }
        $opportunities = $query->latest()->paginate(10);