app/Http/Controllers/ServiceTypeController.php

    public function index(Request $request)
    {
        // Configurazione per i Tipi di Servizio
        $defaultColumns = ['name', 'description'];
        $columnLabels = ['name' => 'Nome Servizio', 'description' => 'Descrizione'];

        // Otteniamo i dati della vista dal Trait
        $viewData = $this->getListViewData($request, ServiceType::class, $defaultColumns, $columnLabels);

        // Eseguiamo la query
        $columnsForQuery = array_unique(array_merge($viewData['currentView']->columns, ['id']));
        $serviceTypes = ServiceType::select($columnsForQuery)->latest()->paginate(15);
---
select count(*) as aggregate from `service_types`