app/Http/Controllers/TagController.php

select count(*) as aggregate from `tags`
---
    public function index()
    {
        $tags = Tag::latest()->paginate(15);