app/Http/Controllers/WorkflowController.php

select count(*) as aggregate from `workflows`
---
    public function index()
    {
        $workflows = Workflow::latest()->paginate(15);

select * from `email_lists` order by `name` asc
select * from `tags` order by `name` asc
select * from `email_templates` order by `name` asc
---
    public function create()
    {
        $workflow = $this->prepareWorkflowForView();
        return view('workflows.create', [
            'workflow' => $workflow,
            'availableModels' => config('workflows.available_models', []),
            'emailLists' => EmailList::orderBy('name')->get(),
            'tags' => Tag::orderBy('name')->get(),
            'emailTemplates' => EmailTemplate::orderBy('name')->get(),